zephyrproject-rtos/zephyr/boards/microchip/pic32cxsg41_cult/support/svd/PIC32CX1025SG41100.svd
            <register>
               <name>DSEQSTAT</name>
               <description>DMA Sequencial Status</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INPUTCTRL</name>
                     <description>Input Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTRLB</name>
                     <description>Control B</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REFCTRL</name>
                     <description>Reference Control</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AVGCTRL</name>
                     <description>Average Control</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SAMPCTRL</name>
                     <description>Sampling Time Control</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WINLT</name>
                     <description>Window Monitor Lower Threshold</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WINUT</name>
                     <description>Window Monitor Upper Threshold</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GAINCORR</name>
                     <description>Gain Correction</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFFSETCORR</name>
                     <description>Offset Correction</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>DMA Sequencing Busy</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RESULT</name>
               <description>Result Conversion Value</description>
               <addressOffset>0x40</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>RESULT</name>
                     <description>Result Conversion Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RESS</name>
               <description>Last Sample Result</description>
               <addressOffset>0x44</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>RESS</name>
                     <description>Last ADC conversion result</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALIB</name>
               <description>Calibration</description>
               <addressOffset>0x48</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>BIASCOMP</name>
                     <description>Bias Comparator Scaling</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>BIASR2R</name>
                     <description>Bias R2R Ampli scaling</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>BIASREFBUF</name>
                     <description>Bias  Reference Buffer Scaling</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral derivedFrom="ADC0">
         <name>ADC1</name>
         <baseAddress>0x43002000</baseAddress>
         <interrupt>
            <name>ADC1_OTHER</name>
            <description>Analog To Digital Converter 1</description>
            <value>120</value>
         </interrupt>
         <interrupt>
            <name>ADC1_RESRDY</name>
            <description>ADC1 Result Ready</description>
            <value>121</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>AES</name>
         <version>U22382.2.0</version>
         <description>Advanced Encryption Standard</description>
         <baseAddress>0x42002400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x88</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>AES</name>
            <description>Advanced Encryption Standard</description>
            <value>130</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control A</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AESMODE</name>
                     <description>AES Modes of operation</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>AESMODESelect</name>
                        <enumeratedValue>
                           <name>ECB</name>
                           <description>Electronic code book mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CBC</name>
                           <description>Cipher block chaining mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFB</name>
                           <description>Output feedback mode</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CFB</name>
                           <description>Cipher feedback mode</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COUNTER</name>
                           <description>Counter mode</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CCM</name>
                           <description>CCM mode</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCM</name>
                           <description>Galois counter mode</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CFBS</name>
                     <description>Cipher Feedback Block Size</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>CFBSSelect</name>
                        <enumeratedValue>
                           <name>128BIT</name>
                           <description>128-bit Input data block for Encryption/Decryption in Cipher Feedback mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>64BIT</name>
                           <description>64-bit Input data block for Encryption/Decryption in Cipher Feedback mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32BIT</name>
                           <description>32-bit Input data block for Encryption/Decryption in Cipher Feedback mode</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16BIT</name>
                           <description>16-bit Input data block for Encryption/Decryption in Cipher Feedback mode</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8BIT</name>
                           <description>8-bit Input data block for Encryption/Decryption in Cipher Feedback mode</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>KEYSIZE</name>
                     <description>Encryption Key Size</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>KEYSIZESelect</name>
                        <enumeratedValue>
                           <name>128BIT</name>
                           <description>128-bit Key for Encryption / Decryption</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>192BIT</name>
                           <description>192-bit Key for Encryption / Decryption</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>256BIT</name>
                           <description>256-bit Key for Encryption / Decryption</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CIPHER</name>
                     <description>Cipher Mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CIPHERSelect</name>
                        <enumeratedValue>
                           <name>DEC</name>
                           <description>Decryption</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENC</name>
                           <description>Encryption</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STARTMODE</name>
                     <description>Start Mode Select</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>STARTMODESelect</name>
                        <enumeratedValue>
                           <name>MANUAL</name>
                           <description>Start Encryption / Decryption in Manual mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AUTO</name>
                           <description>Start Encryption / Decryption in Auto mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LOD</name>
                     <description>Last Output Data Mode</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LODSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No effect</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LAST</name>
                           <description>Start encryption in Last Output Data mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>KEYGEN</name>
                     <description>Last Key Generation</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>KEYGENSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No effect</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LAST</name>
                           <description>Start Computation of the last NK words of the expanded key</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>XORKEY</name>
                     <description>XOR Key Operation</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>XORKEYSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No effect</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XOR</name>
                           <description>The user keyword gets XORed with the previous keyword register content.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CTYPE</name>
                     <description>Counter Measure Type</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLB</name>
               <description>Control B</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>START</name>
                     <description>Start Encryption/Decryption</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NEWMSG</name>
                     <description>New message</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOM</name>
                     <description>End of message</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GFMUL</name>
                     <description>GF Multiplication</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x5</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ENCCMP</name>
                     <description>Encryption Complete Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GFMCMP</name>
                     <description>GF Multiplication Complete Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x6</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ENCCMP</name>
                     <description>Encryption Complete Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GFMCMP</name>
                     <description>GF Multiplication Complete Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status</description>
               <addressOffset>0x7</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ENCCMP</name>
                     <description>Encryption Complete</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GFMCMP</name>
                     <description>GF Multiplication Complete</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DATABUFPTR</name>
               <description>Data buffer pointer</description>
               <addressOffset>0x8</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>INDATAPTR</name>
                     <description>Input Data Pointer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBGCTRL</name>
               <description>Debug control</description>
               <addressOffset>0x9</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DBGRUN</name>
                     <description>Debug Run</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>KEYWORD[%s]</name>
               <description>Keyword n</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEYWORD</name>
                     <description>Key Word Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INDATA</name>
               <description>Indata</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INDATA</name>
                     <description>Data Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
