zephyrproject-rtos/zephyr/boards/microchip/pic32cxsg41_cult/support/svd/PIC32CX1025SG41100.svd
            <register>
               <name>MCCAR</name>
               <description>Maximum Current Capabilities</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MAXCUR33V</name>
                     <description>Maximum Current for 3.3V</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>MAXCUR33VSelect</name>
                        <enumeratedValue>
                           <name>OTHER</name>
                           <description>Get information via another method</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4MA</name>
                           <description>4mA</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8MA</name>
                           <description>8mA</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>12MA</name>
                           <description>12mA</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MAXCUR30V</name>
                     <description>Maximum Current for 3.0V</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>MAXCUR30VSelect</name>
                        <enumeratedValue>
                           <name>OTHER</name>
                           <description>Get information via another method</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4MA</name>
                           <description>4mA</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8MA</name>
                           <description>8mA</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>12MA</name>
                           <description>12mA</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MAXCUR18V</name>
                     <description>Maximum Current for 1.8V</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>MAXCUR18VSelect</name>
                        <enumeratedValue>
                           <name>OTHER</name>
                           <description>Get information via another method</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4MA</name>
                           <description>4mA</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8MA</name>
                           <description>8mA</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>12MA</name>
                           <description>12mA</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FERACES</name>
               <description>Force Event for Auto CMD Error Status</description>
               <addressOffset>0x50</addressOffset>
               <size>16</size>
               <access>write-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ACMD12NE</name>
                     <description>Force Event for Auto CMD12 Not Executed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ACMD12NESelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACMDTEO</name>
                     <description>Force Event for Auto CMD Timeout Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ACMDTEOSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACMDCRC</name>
                     <description>Force Event for Auto CMD CRC Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ACMDCRCSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACMDEND</name>
                     <description>Force Event for Auto CMD End Bit Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ACMDENDSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACMDIDX</name>
                     <description>Force Event for Auto CMD Index Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ACMDIDXSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMDNI</name>
                     <description>Force Event for Command Not Issued By Auto CMD12 Error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CMDNISelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEREIS</name>
               <description>Force Event for Error Interrupt Status</description>
               <addressOffset>0x52</addressOffset>
               <size>16</size>
               <access>write-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>CMDTEO</name>
                     <description>Force Event for Command Timeout Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CMDTEOSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMDCRC</name>
                     <description>Force Event for Command CRC Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CMDCRCSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMDEND</name>
                     <description>Force Event for Command End Bit Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CMDENDSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMDIDX</name>
                     <description>Force Event for Command Index Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CMDIDXSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DATTEO</name>
                     <description>Force Event for Data Timeout Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DATTEOSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DATCRC</name>
                     <description>Force Event for Data CRC Error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DATCRCSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DATEND</name>
                     <description>Force Event for Data End Bit Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DATENDSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CURLIM</name>
                     <description>Force Event for Current Limit Error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CURLIMSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACMD</name>
                     <description>Force Event for Auto CMD Error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ACMDSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADMA</name>
                     <description>Force Event for ADMA Error</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ADMASelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BOOTAE</name>
                     <description>Force Event for Boot Acknowledge Error</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BOOTAESelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESR</name>
               <description>ADMA Error Status</description>
               <addressOffset>0x54</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ERRST</name>
                     <description>ADMA Error State</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>ERRSTSelect</name>
                        <enumeratedValue>
                           <name>STOP</name>
                           <description>ST_STOP (Stop DMA)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FDS</name>
                           <description>ST_FDS (Fetch Descriptor)</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TFR</name>
                           <description>ST_TFR (Transfer Data)</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LMIS</name>
                     <description>ADMA Length Mismatch Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LMISSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Error</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Error</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>1</dim>
               <dimIncrement>4</dimIncrement>
               <name>ASAR[%s]</name>
               <description>ADMA System Address</description>
               <addressOffset>0x58</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADMASA</name>
                     <description>ADMA System Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
