zephyrproject-rtos/zephyr/boards/microchip/pic32cxsg41_cult/support/svd/PIC32CX1025SG41100.svd
            <register>
               <dim>8</dim>
               <dimIncrement>2</dimIncrement>
               <name>PVR[%s]</name>
               <description>Preset Value n</description>
               <addressOffset>0x60</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>SDCLKFSEL</name>
                     <description>SDCLK Frequency Select Value for Initialization</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>CLKGSEL</name>
                     <description>Clock Generator Select Value for Initialization</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CLKGSELSelect</name>
                        <enumeratedValue>
                           <name>DIV</name>
                           <description>Host Controller Ver2.00 Compatible Clock Generator (Divider)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PROG</name>
                           <description>Programmable Clock Generator</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DRVSEL</name>
                     <description>Driver Strength Select Value for Initialization</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DRVSELSelect</name>
                        <enumeratedValue>
                           <name>B</name>
                           <description>Driver Type B is Selected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>A</name>
                           <description>Driver Type A is Selected</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>C</name>
                           <description>Driver Type C is Selected</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>D</name>
                           <description>Driver Type D is Selected</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SISR</name>
               <description>Slot Interrupt Status</description>
               <addressOffset>0xFC</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>INTSSL</name>
                     <description>Interrupt Signal for Each SDHC Slot</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCVR</name>
               <description>Host Controller Version</description>
               <addressOffset>0xFE</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <resetValue>0x1802</resetValue>
               <fields>
                  <field>
                     <name>SVER</name>
                     <description>Spec Version</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>VVER</name>
                     <description>Vendor Version</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APSR</name>
               <description>Additional Present State Register</description>
               <addressOffset>0x200</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x0000000F</resetValue>
               <fields>
                  <field>
                     <name>HDATLL</name>
                     <description>High Line Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MC1R</name>
               <description>MMC Control 1</description>
               <addressOffset>0x204</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>CMDTYP</name>
                     <description>e.MMC Command Type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CMDTYPSelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Not a MMC specific command</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WAITIRQ</name>
                           <description>Wait IRQ Command</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STREAM</name>
                           <description>Stream Command</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOOT</name>
                           <description>Boot Command</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DDR</name>
                     <description>e.MMC HSDDR Mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPD</name>
                     <description>e.MMC Open Drain Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOOTA</name>
                     <description>e.MMC Boot Acknowledge Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSTN</name>
                     <description>e.MMC Reset Signal</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCD</name>
                     <description>e.MMC Force Card Detect</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MC2R</name>
               <description>MMC Control 2</description>
               <addressOffset>0x205</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SRESP</name>
                     <description>e.MMC Abort Wait IRQ</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABOOT</name>
                     <description>e.MMC Abort Boot</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACR</name>
               <description>AHB Control</description>
               <addressOffset>0x208</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BMAX</name>
                     <description>AHB Maximum Burst</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>BMAXSelect</name>
                        <enumeratedValue>
                           <name>INCR16</name>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR8</name>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR4</name>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CC2R</name>
               <description>Clock Control 2</description>
               <addressOffset>0x20C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FSDCLKD</name>
                     <description>Force SDCK Disabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FSDCLKDSelect</name>
                        <enumeratedValue>
                           <name>NOEFFECT</name>
                           <description>No effect</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>SDCLK can be stopped at any time after DATA transfer.SDCLK enable forcing for 8 SDCLK cycles is disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CACR</name>
               <description>Capabilities Control</description>
               <addressOffset>0x230</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CAPWREN</name>
                     <description>Capabilities Registers Write Enable (Required to write the correct frequencies in the Capabilities Registers)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Key (0x46)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>KEY</name>
                           <description>Key</description>
                           <value>0x46</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBGR</name>
               <description>Debug</description>
               <addressOffset>0x234</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>NIDBG</name>
                     <description>Non-intrusive debug enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>NIDBGSelect</name>
                        <enumeratedValue>
                           <name>IDBG</name>
                           <description>Debugging is intrusive (reads of BDPR from debugger are considered and increment the internal buffer pointer)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NIDBG</name>
                           <description>Debugging is not intrusive (reads of BDPR from debugger are discarded and do not increment the internal buffer pointer)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
