zephyrproject-rtos/zephyr/boards/microchip/pic32cxsg41_cult/support/svd/PIC32CX1025SG41100.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC1</name>
         <baseAddress>0x41018000</baseAddress>
         <interrupt>
            <name>TCC1_OTHER</name>
            <description>Timer Counter Control 1</description>
            <value>92</value>
         </interrupt>
         <interrupt>
            <name>TCC1_MC0</name>
            <description>TCC Match/Compare 0</description>
            <value>93</value>
         </interrupt>
         <interrupt>
            <name>TCC1_MC1</name>
            <description>TCC Match/Compare 1</description>
            <value>94</value>
         </interrupt>
         <interrupt>
            <name>TCC1_MC2</name>
            <description>TCC Match/Compare 2</description>
            <value>95</value>
         </interrupt>
         <interrupt>
            <name>TCC1_MC3</name>
            <description>TCC Match/Compare 3</description>
            <value>96</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC2</name>
         <baseAddress>0x42000C00</baseAddress>
         <interrupt>
            <name>TCC2_OTHER</name>
            <description>Timer Counter Control 2</description>
            <value>97</value>
         </interrupt>
         <interrupt>
            <name>TCC2_MC0</name>
            <description>TCC Match/Compare 0</description>
            <value>98</value>
         </interrupt>
         <interrupt>
            <name>TCC2_MC1</name>
            <description>TCC Match/Compare 1</description>
            <value>99</value>
         </interrupt>
         <interrupt>
            <name>TCC2_MC2</name>
            <description>TCC Match/Compare 2</description>
            <value>100</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC3</name>
         <baseAddress>0x42001000</baseAddress>
         <interrupt>
            <name>TCC3_OTHER</name>
            <description>Timer Counter Control 3</description>
            <value>101</value>
         </interrupt>
         <interrupt>
            <name>TCC3_MC0</name>
            <description>TCC Match/Compare 0</description>
            <value>102</value>
         </interrupt>
         <interrupt>
            <name>TCC3_MC1</name>
            <description>TCC Match/Compare 1</description>
            <value>103</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="TCC0">
         <name>TCC4</name>
         <baseAddress>0x43001000</baseAddress>
         <interrupt>
            <name>TCC4_OTHER</name>
            <description>Timer Counter Control 4</description>
            <value>104</value>
         </interrupt>
         <interrupt>
            <name>TCC4_MC0</name>
            <description>TCC Match/Compare 0</description>
            <value>105</value>
         </interrupt>
         <interrupt>
            <name>TCC4_MC1</name>
            <description>TCC Match/Compare 1</description>
            <value>106</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>TRNG</name>
         <version>U22421.1.0</version>
         <description>True Random Generator</description>
         <baseAddress>0x42002800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x24</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>TRNG</name>
            <description>True Random Generator</description>
            <value>131</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control A</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVCTRL</name>
               <description>Event Control</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DATARDYEO</name>
                     <description>Data Ready Event Output</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x8</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DATARDY</name>
                     <description>Data Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x9</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DATARDY</name>
                     <description>Data Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0xA</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DATARDY</name>
                     <description>Data Ready Interrupt Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DATA</name>
               <description>Output Data</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
